// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16


Console.WriteLine ("Введите число N: ");
int number = Convert.ToInt32(Console.ReadLine());




void PrintDegree (int num1, int num2)
{
    int num1 = 
}